vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Keil.STM32H5xx_DFP.pdsc
<?xml version="1.0" encoding="UTF-8"?>
<package schemaVersion="1.7.36" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="https://raw.githubusercontent.com/Open-CMSIS-Pack/Open-CMSIS-Pack-Spec/v1.7.36/schema/PACK.xsd">
  <vendor>Keil</vendor>
  <name>STM32H5xx_DFP</name>
  <description overview="Documents/OVERVIEW.md">STMicroelectronics STM32H5 Series Device Support</description>
  <url>https://www.keil.com/pack/</url>
  <repository type="git">https://github.com/Open-CMSIS-Pack/STM32H5xx_DFP.git</repository>
  <license>LICENSE</license>
  <licenseSets>
    <licenseSet id="all" default="true" gating="true">
      <license title="Apache-2.0 License for CMSIS add-ons" name="LICENSE" spdx="Apache-2.0"/>
    </licenseSet>
  </licenseSets>

  <releases>
    <release version="2.1.1" date="2025-09-10" tag="v2.1.1">
      Updated debug configuration files
      Package Description (pdsc):
      - Shortened device family description
    </release>
    <release version="2.1.0" date="2025-07-01" tag="v2.1.0">
      Updated Templates:
      - Added DWARF-5 debug information
      - Added generated output files
      Pack Description:
      - Correct RCC_AHB2ENR register name in debug sequence comments
      Updated documentation references
    </release>
    <release version="2.0.0" date="2024-12-18" tag="v2.0.0">
      Updated for new CMSIS-Toolbox CubeMX integration
      Removed STM32CubeMX_FW_H5
      Removed previous generator (gpdsc)
      Removed CMSIS drivers
      Added new global generator
      Package Description (pdsc):
      - Removed Device:Startup component
      - Removed Device:STM32Cube HAL components
      - Removed Device:STM32Cube LL components
      - Removed compile device header from device description
      - Removed unused conditions
      - Replaced documentation files with permalinks
    </release>
    <release version="1.3.0" date="2024-04-04">
      Updated to STM32Cube_FW_H5 Firmware Package version V1.2.0
      Devices Support:
      - Added support to:
      -- H533/H523 lines with 512KB/256KB flash: Internal Non-secure/Secure Flash programming
      -- H563/H562 lines with 1MB flash: Internal Non-secure/Secure Flash programming
      - Fixed flashloader sector erase if the flash size less then 2MB
      - Added H523/H533 SVD files
      - Updated SVD files for H573/H563/H562/H503
      - Updated device documentation
    </release>
    <release version="1.2.0" date="2023-09-01">
      Devices Support:
      - Updated to STM32Cube_FW_H5 Firmware Package version V1.1.0
      STM32CubeMX integration:
      - Added support for MEMORYMAP initialization (FrameworkCubeMX_gpdsc.ftl)
      CMSIS-Driver:
      - USB Device:
      -- Updated PowerControl function (added check if Instance is valid)
      -- Updated GetFrameNumber function (use LL function)
    </release>
    <release version="1.1.0" date="2023-07-10">
      CMSIS Driver:
      - Added Ethernet driver
      - Added I2C driver
      - Added SPI driver
      - Added USART/UART driver
      - Added USB Device driver
      Device Support:
      - Corrected TZ feature for STM32H503 devices
      - Added CubeMX support
      - Added datasheets and reference manuals
    </release>
    <release version="1.0.0" date="2023-03-13">
      Initial public release.
      Devices Support:
      - Updated STM32Cube_FW_H5 Firmware Package version to V1.0.0 (HAL v1.0.0)
    </release>
  </releases>

  <keywords>
    <keyword>ST</keyword>
    <keyword>Device Support</keyword>
    <keyword>Device Family Package STMicroelectronics</keyword>
    <keyword>STM32H5</keyword>
    <keyword>STM32H5xx</keyword>
  </keywords>

  <devices>
    <family Dfamily="STM32H5 Series" Dvendor="STMicroelectronics:13">
      <processor Dcore="Cortex-M33" DcoreVersion="r0p0" Dfpu="SP_FPU" Dmpu="MPU" Ddsp="DSP" Dendian="Little-endian" Dclock="240000000"/>
      <description>
High-performance STM32H5 MCUs with Arm Cortex-M33 core, MPU, instruction cache, DSP, FPU, 375 DMIPS at 250 MHz.
      </description>

      <book name="https://developer.arm.com/documentation/100235/latest/" title="Arm Cortex-M33 Devices"/>

      <sequences>
        <!-- Override for Pre-Defined Sequences -->
        <sequence name="DebugDeviceUnlock">
          <block>
            __var traceSWO    = (__traceout &amp; 0x1) != 0;                        // SWO enabled?
            __var traceTPIU   = (__traceout &amp; 0x2) != 0;                        // Synchronous trace port enabled?

            Sequence("CheckID");
          </block>

          <control if="traceSWO">
            <block>
              Sequence("ConfigureTraceSWOClock");
            </block>
          </control>

          <control if="traceTPIU">
            <block>
              Sequence("ConfigureTraceTPIUClock");
            </block>
          </control>

        </sequence>

        <sequence name="DebugCoreStart">
          <block>
            __var ap = __ap;                                                        // Save current AP

            // Replication of Standard Functionality
            Write32(0xE000EDF0, 0xA05F0001);                                        // Enable Core Debug via DHCSR

            // Device Specific Debug Setup
            __ap = 0;                                                               // Select System debug access port (AP0)
            Write32(0xE0044004, DbgMCU_CR | (Read32(0xE0044004) &amp; 0xF0));       // DBGMCU_CR: Configure MCU Debug
            Write32(0xE0044008, DbgMCU_APB1L_Fz);                                   // DBGMCU_APB1_FZ: Configure APB1L Peripheral Freeze Behavior
            Write32(0xE004400C, DbgMCU_APB1H_Fz);                                   // DBGMCU_APB1_FZ: Configure APB1H Peripheral Freeze Behavior
            Write32(0xE0044010, DbgMCU_APB2_Fz);                                    // DBGMCU_APB1_FZ: Configure APB2 Peripheral Freeze Behavior
            Write32(0xE0044014, DbgMCU_APB3_Fz);                                    // DBGMCU_APB3FZR: Configure APB3 Peripheral Freeze Behavior
            Write32(0xE0044020, DbgMCU_AHB1_Fz);                                    // DBGMCU_AHB1FZR: Configure AHB1 Peripheral Freeze Behavior
            __ap = ap;                                                              // Restore AP
          </block>
        </sequence>

        <!-- Override for Pre-Defined TraceStart Sequence -->
        <sequence name="TraceStart">
          <block>
            __var traceSWO    = (__traceout &amp; 0x1) != 0;                        // SWO (asynchronous) Trace Selected?
            __var traceTPIU   = (__traceout &amp; 0x2) != 0;                        // Synchronous trace port enabled?
          </block>

