vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Keil.STM32H5xx_DFP.pdsc
          <control if="traceSWO">
            <block>
              Sequence("EnableTraceSWO");                                           // Call SWO Trace Setup
            </block>
          </control>

          <control if="traceTPIU">
            <block>
              Sequence("EnableTraceTPIU");                                          // Call TPIU Trace Setup
            </block>
          </control>

        </sequence>

        <sequence name="TraceStop">
          <block>
            __var traceSWO    = (__traceout &amp; 0x1) != 0;                        // SWO enabled?
            __var traceTPIU   = (__traceout &amp; 0x2) != 0;                        // Synchronous trace port enabled?
          </block>

          <control if="traceSWO">
            <block>
              Sequence("DisableTraceSWO");
            </block>
          </control>

          <control if="traceTPIU">
            <block>
              Sequence("DisableTraceTPIU");
            </block>
          </control>
        </sequence>

        <!-- User-Defined Sequences -->
        <sequence name="CheckID">
          <block>
            __var pidr1 = 0;
            __var pidr2 = 0;
            __var jep106id = 0;
            __var ROMTableBase = 0;

            __ap = 0;      // AHB-AP

            ROMTableBase = ReadAP(0xF8) &amp; ~0x3;

            pidr1 = Read32(ROMTableBase + 0x0FE4);
            pidr2 = Read32(ROMTableBase + 0x0FE8);
            jep106id = ((pidr2 &amp; 0x7) &lt;&lt; 4 ) | ((pidr1 &gt;&gt; 4) &amp; 0xF);
          </block>

          <control if="jep106id != 0x20">
            <block>
              Query(0, "Not a genuine ST Device! Abort connection", 1);
              Message(2, "Not a genuine ST Device! Abort connection.");
            </block>
          </control>
        </sequence>

        <sequence name="EnableTraceSWO">
          <block>
            Sequence("ConfigureTraceSWOPin");
            Sequence("ConfigureTraceSWOClock");
          </block>
        </sequence>

        <sequence name="DisableTraceSWO">
          <block>
            __var ap = __ap;                                                        // Save current AP
            __var dbgmcu_val       = 0;                                             // DBGMCU_CR Value
          </block>

          <block info="unconfigure Trace Port and Clock Enable + Trace I/O Enable + Trace Mode Asynchronous">
            __ap = 0;                                                               // Select System debug access port (AP0)
            dbgmcu_val = Read32(0xE0044004) &amp; (~0xF0);                          // Read DBGMCU_CR and clear trace setup
            Write32(0xE0044004, dbgmcu_val);                                        // Write DBGMCU_CR: Trace Settings
            __ap = ap;                                                              // Restore AP
          </block>
        </sequence>

        <sequence name="EnableTraceTPIU">
          <block>
            Sequence("ConfigureTraceTPIUPins");
            Sequence("ConfigureTraceTPIUClock");
          </block>
        </sequence>

        <sequence name="DisableTraceTPIU">
          <block>
            __var ap = __ap;                                                        // Save current AP
            __var dbgmcu_val       = 0;                                             // DBGMCU_CR Value
          </block>

          <block info="unconfigure Trace I/O Enable + Trace Mode Synchronous">
            __ap = 0;                                                               // Select System debug access port (AP0)
            dbgmcu_val = Read32(0xE0044004) &amp; (~0xF0);                          // Read DBGMCU_CR and clear trace setup
            Write32(0xE0044004, dbgmcu_val);                                        // Write DBGMCU_CR: Trace Settings
            __ap = ap;                                                              // Restore AP
          </block>
        </sequence>

        <sequence name="ConfigureTraceSWOClock">
          <block>
            __var ap = __ap;                                                        // Save current AP
            __var dbgmcu_val       = 0;                                             // DBGMCU_CR Value
            __var dbgmcu_trace_val = 0;                                             // DBGMCU_CR Value

            __ap = 0;                                                               // Select System debug access port (AP0)
            dbgmcu_val        = Read32(0xE0044004) &amp; (~0xF0);                   // Read DBGMCU_CR and clear trace setup
            dbgmcu_trace_val  = (1 &lt;&lt; 5) | (1 &lt;&lt; 4);                    // Trace Port and Clock Enable + Trace I/O Enable + Trace Mode Asynchronous
            __ap = ap;                                                              // Restore AP
          </block>

          <block info="configure Trace I/O Enable + Trace Mode Asynchronous">
            __ap = 0;                                                               // Select System debug access port (AP0)
            Write32(0xE0044004, dbgmcu_val | dbgmcu_trace_val);                     // Write DBGMCU_CR: Trace Settings
            __ap = ap;                                                              // Restore AP
          </block>
        </sequence>

        <sequence name="ConfigureTraceTPIUClock">
          <block>
            __var ap = __ap;                                                        // Save current AP
            __var dbgmcu_val       = 0;                                             // DBGMCU_CR Value
            __var dbgmcu_trace_val = 0;                                             // DBGMCU_CR Value
            __var width            = (__traceout &amp; 0x003F0000) &gt;&gt; 16;

            __ap = 0;                                                               // Select System debug access port (AP0)
            dbgmcu_val = Read32(0xE0044004) &amp; (~0xF0);                          // Read DBGMCU_CR and clear trace setup
            __ap = ap;                                                              // Restore AP
          </block>

          <control if="width &gt;= 1" info="TPIU port width 1">
            <block info="configure Trace Port and Clock Enable + Trace I/O Enable + Trace Mode Synchronous 1 bit">
              dbgmcu_trace_val  = (3 &lt;&lt; 5) | (1 &lt;&lt; 4);
            </block>
          </control>

          <control if="width &gt;= 2" info="TPIU port width 2">
            <block info="configure Trace Port and Clock Enable + Trace I/O Enable + Trace Mode Synchronous 2 bit">
              dbgmcu_trace_val  = (5 &lt;&lt; 5) | (1 &lt;&lt; 4);
            </block>
          </control>

          <control if="width &gt;= 4" info="TPIU port width 4">
            <block info="configure Trace Port and Clock Enable + Trace I/O Enable + Trace Mode Synchronous 4 bit">
              dbgmcu_trace_val  = (7 &lt;&lt; 5) | (1 &lt;&lt; 4);
            </block>
          </control>

          <block info="configure Trace I/O Enable + Trace Mode Asynchronous">
            __ap = 0;                                                               // Select System debug access port (AP0)
            Write32(0xE0044004, dbgmcu_val | dbgmcu_trace_val);                     // Write DBGMCU_CR: Trace Settings
            __ap = ap;                                                              // Restore AP
          </block>
        </sequence>

        <sequence name="ConfigureTraceSWOPin">
          <block>
            __var pin     = 0;
            __var port    = 0;
            __var portAdr = 0;
            __var pos     = 0;
            __var secOffs = 0x00000000;

