vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Keil.STM32H5xx_DFP.pdsc
        <!-- ################################### 2MB ################################## -->
        <!-- *************************  Device 'STM32H562RI'   ************************ -->
        <device Dname="STM32H562RITx">
          <memory name="Flash"   access="rx"                  start="0x08000000" size="0x00200000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32H5xx_2M_0800.FLM" start="0x08000000" size="0x00200000" default="1" RAMstart="0x20000000" RAMsize="0x8000" />
          <algorithm name="CMSIS/Flash/STM32H5xx_2M_0C00.FLM" start="0x0C000000" size="0x00200000" default="1" RAMstart="0x20000000" RAMsize="0x8000" />
          <feature type="QFP" n="64"/>
        </device>
        <device Dname="STM32H562RIVx">
          <memory name="Flash"   access="rx"                  start="0x08000000" size="0x00200000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32H5xx_2M_0800.FLM" start="0x08000000" size="0x00200000" default="1" RAMstart="0x20000000" RAMsize="0x8000" />
          <algorithm name="CMSIS/Flash/STM32H5xx_2M_0C00.FLM" start="0x0C000000" size="0x00200000" default="1" RAMstart="0x20000000" RAMsize="0x8000" />
          <feature type="QFN" n="68"/>
        </device>

        <!-- *************************  Device 'STM32H562VI'  ************************* -->
        <device Dname="STM32H562VITx">
          <memory name="Flash"   access="rx"                  start="0x08000000" size="0x00200000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32H5xx_2M_0800.FLM" start="0x08000000" size="0x00200000" default="1" RAMstart="0x20000000" RAMsize="0x8000" />
          <algorithm name="CMSIS/Flash/STM32H5xx_2M_0C00.FLM" start="0x0C000000" size="0x00200000" default="1" RAMstart="0x20000000" RAMsize="0x8000" />
          <feature type="QFP" n="100"/>
        </device>

        <!-- *************************  Device 'STM32H562ZI'   ************************ -->
        <device Dname="STM32H562ZITx">
          <memory name="Flash"   access="rx"                  start="0x08000000" size="0x00200000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32H5xx_2M_0800.FLM" start="0x08000000" size="0x00200000" default="1" RAMstart="0x20000000" RAMsize="0x8000" />
          <algorithm name="CMSIS/Flash/STM32H5xx_2M_0C00.FLM" start="0x0C000000" size="0x00200000" default="1" RAMstart="0x20000000" RAMsize="0x8000" />
          <feature type="QFP" n="144"/>
        </device>

        <!-- *************************  Device 'STM32H562II'   ************************ -->
        <device Dname="STM32H562IITx">
          <memory name="Flash"   access="rx"                  start="0x08000000" size="0x00200000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32H5xx_2M_0800.FLM" start="0x08000000" size="0x00200000" default="1" RAMstart="0x20000000" RAMsize="0x8000" />
          <algorithm name="CMSIS/Flash/STM32H5xx_2M_0C00.FLM" start="0x0C000000" size="0x00200000" default="1" RAMstart="0x20000000" RAMsize="0x8000" />
          <feature type="QFP" n="176"/>
        </device>
        <device Dname="STM32H562IIKx">
          <memory name="Flash"   access="rx"                  start="0x08000000" size="0x00200000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32H5xx_2M_0800.FLM" start="0x08000000" size="0x00200000" default="1" RAMstart="0x20000000" RAMsize="0x8000" />
          <algorithm name="CMSIS/Flash/STM32H5xx_2M_0C00.FLM" start="0x0C000000" size="0x00200000" default="1" RAMstart="0x20000000" RAMsize="0x8000" />
          <feature type="BGA" n="176"/>
        </device>

        <!-- *************************  Device 'STM32H562AI'   ************************ -->
        <device Dname="STM32H562AIIx">
          <memory name="Flash"   access="rx"                  start="0x08000000" size="0x00200000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32H5xx_2M_0800.FLM" start="0x08000000" size="0x00200000" default="1" RAMstart="0x20000000" RAMsize="0x8000" />
          <algorithm name="CMSIS/Flash/STM32H5xx_2M_0C00.FLM" start="0x0C000000" size="0x00200000" default="1" RAMstart="0x20000000" RAMsize="0x8000" />
          <feature type="BGA" n="169"/>
        </device>
        <!-- ################################### 1MB ################################## -->
        <!-- *************************  Device 'STM32H562RG'   ************************ -->
        <device Dname="STM32H562RGTx">
          <memory name="Flash"   access="rx"                  start="0x08000000" size="0x00100000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32H5xx_1M_0800.FLM" start="0x08000000" size="0x00100000" default="1" RAMstart="0x20000000" RAMsize="0x8000" />
          <algorithm name="CMSIS/Flash/STM32H5xx_1M_0C00.FLM" start="0x0C000000" size="0x00100000" default="1" RAMstart="0x20000000" RAMsize="0x8000" />
          <feature type="QFP" n="64"/>
        </device>
        <device Dname="STM32H562RGVx">
          <memory name="Flash"   access="rx"                  start="0x08000000" size="0x00100000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32H5xx_1M_0800.FLM" start="0x08000000" size="0x00100000" default="1" RAMstart="0x20000000" RAMsize="0x8000" />
          <algorithm name="CMSIS/Flash/STM32H5xx_1M_0C00.FLM" start="0x0C000000" size="0x00100000" default="1" RAMstart="0x20000000" RAMsize="0x8000" />
          <feature type="QFN" n="68"/>
        </device>
        <!-- *************************  Device 'STM32H562VG'   ************************ -->
        <device Dname="STM32H562VGTx">
          <memory name="Flash"   access="rx"                  start="0x08000000" size="0x00100000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32H5xx_1M_0800.FLM" start="0x08000000" size="0x00100000" default="1" RAMstart="0x20000000" RAMsize="0x8000" />
          <algorithm name="CMSIS/Flash/STM32H5xx_1M_0C00.FLM" start="0x0C000000" size="0x00100000" default="1" RAMstart="0x20000000" RAMsize="0x8000" />
          <feature type="QFP" n="64"/>
        </device>

