vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Keil.STM32H5xx_DFP.pdsc
        <device Dname="STM32H563RGVx">
          <memory name="Flash"   access="rx"                  start="0x08000000" size="0x00100000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32H5xx_1M_0800.FLM" start="0x08000000" size="0x00100000" default="1" RAMstart="0x20000000" RAMsize="0x8000" />
          <algorithm name="CMSIS/Flash/STM32H5xx_1M_0C00.FLM" start="0x0C000000" size="0x00100000" default="1" RAMstart="0x20000000" RAMsize="0x8000" />
          <feature type="QFN" n="68"/>
        </device>
        <!-- *************************  Device 'STM32H563VG'   ************************ -->
        <device Dname="STM32H563VGTx">
          <memory name="Flash"   access="rx"                  start="0x08000000" size="0x00100000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32H5xx_1M_0800.FLM" start="0x08000000" size="0x00100000" default="1" RAMstart="0x20000000" RAMsize="0x8000" />
          <algorithm name="CMSIS/Flash/STM32H5xx_1M_0C00.FLM" start="0x0C000000" size="0x00100000" default="1" RAMstart="0x20000000" RAMsize="0x8000" />
          <feature type="QFP" n="64"/>
        </device>

        <!-- *************************  Device 'STM32H563ZG'   ************************ -->
        <device Dname="STM32H563ZGTx">
          <memory name="Flash"   access="rx"                  start="0x08000000" size="0x00100000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32H5xx_1M_0800.FLM" start="0x08000000" size="0x00100000" default="1" RAMstart="0x20000000" RAMsize="0x8000" />
          <algorithm name="CMSIS/Flash/STM32H5xx_1M_0C00.FLM" start="0x0C000000" size="0x00100000" default="1" RAMstart="0x20000000" RAMsize="0x8000" />
          <feature type="QFP" n="144"/>
        </device>
        <!-- *************************  Device 'STM32H563IG'   ************************ -->
        <device Dname="STM32H563IGTx">
          <memory name="Flash"   access="rx"                  start="0x08000000" size="0x00100000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32H5xx_1M_0800.FLM" start="0x08000000" size="0x00100000" default="1" RAMstart="0x20000000" RAMsize="0x8000" />
          <algorithm name="CMSIS/Flash/STM32H5xx_1M_0C00.FLM" start="0x0C000000" size="0x00100000" default="1" RAMstart="0x20000000" RAMsize="0x8000" />
          <feature type="QFP" n="176"/>
        </device>
        <device Dname="STM32H563IGKx">
          <memory name="Flash"   access="rx"                  start="0x08000000" size="0x00100000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32H5xx_1M_0800.FLM" start="0x08000000" size="0x00100000" default="1" RAMstart="0x20000000" RAMsize="0x8000" />
          <algorithm name="CMSIS/Flash/STM32H5xx_1M_0C00.FLM" start="0x0C000000" size="0x00100000" default="1" RAMstart="0x20000000" RAMsize="0x8000" />
          <feature type="BGA" n="176"/>
        </device>

        <!-- *************************  Device 'STM32H563AG'   ************************ -->
        <device Dname="STM32H563AGIx">
          <memory name="Flash"   access="rx"                  start="0x08000000" size="0x00100000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32H5xx_1M_0800.FLM" start="0x08000000" size="0x00100000" default="1" RAMstart="0x20000000" RAMsize="0x8000" />
          <algorithm name="CMSIS/Flash/STM32H5xx_1M_0C00.FLM" start="0x0C000000" size="0x00100000" default="1" RAMstart="0x20000000" RAMsize="0x8000" />
          <feature type="QFP" n="169"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'STM32H573'  *************************** -->
      <subFamily DsubFamily="STM32H573">
        <processor Dtz="TZ"/>
        <debug __ap="1" svd="CMSIS/SVD/STM32H573.svd"/>
        <compile define="STM32H573xx"/>

        <book name="https://www.st.com/resource/en/reference_manual/rm0481-stm32h52333xx-stm32h56263xx-and-stm32h573xx-armbased-32bit-mcus-stmicroelectronics.pdf" title="STM32H523/33xx, STM32H562/63xx and STM32H573xx Reference Manual"/>
        <book name="https://www.st.com/resource/en/datasheet/stm32h573ai.pdf" title="STM32H573xx Data Sheet"/>

        <debugvars configfile="CMSIS/Debug/STM32H562xx_H563xx_H573xx.dbgconf" version="1.0.1">
          __var DbgMCU_CR       = 0x00000006;   // DBGMCU_CR: DBG_STOP, DBG_STANDBY
          __var DbgMCU_APB1L_Fz = 0x00E019FF;   // DGBMCU_APB1LFZR: All Peripherals Operate as in Normal Mode
          __var DbgMCU_APB1H_Fz = 0x00000020;   // DGBMCU_APB1HFZR: All Peripherals Operate as in Normal Mode
          __var DbgMCU_APB2_Fz  = 0x00072800;   // DGBMCU_APB2FZR : All Peripherals Operate as in Normal Mode
          __var DbgMCU_APB3_Fz  = 0x003E0C00;   // DBGMCU_APB3FZR : All Peripherals Operate as in Normal Mode
          __var DbgMCU_AHB1_Fz  = 0x00FF00FF;   // DBGMCU_AHB1FZR : All Peripherals Operate as in Normal Mode
          __var TraceClk_Pin    = 0x00040002;   // PE2
          __var TraceD0_Pin     = 0x00040003;   // PE3
          __var TraceD1_Pin     = 0x00040004;   // PE4
          __var TraceD2_Pin     = 0x00040005;   // PE5
          __var TraceD3_Pin     = 0x00040006;   // PE6
        </debugvars>

        <memory name="SRAM1_2"   access="rwx"                 start="0x20000000" size="0x00050000" default="1" init="0" />
        <memory name="SRAM3"     access="rwx"                 start="0x20050000" size="0x00050000" default="0" init="0" />

        <!-- ################################### 2MB ################################## -->
        <!-- *************************  Device 'STM32H573RI'   ***************************** -->

        <device Dname="STM32H573RITx">
          <memory name="Flash"   access="rx"                  start="0x08000000" size="0x00200000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32H5xx_2M_0800.FLM" start="0x08000000" size="0x00200000" default="1" RAMstart="0x20000000" RAMsize="0x8000" />
          <algorithm name="CMSIS/Flash/STM32H5xx_2M_0C00.FLM" start="0x0C000000" size="0x00200000" default="1" RAMstart="0x20000000" RAMsize="0x8000" />
          <feature type="QFP" n="64"/>
        </device>
        <device Dname="STM32H573RIVx">
          <memory name="Flash"   access="rx"                  start="0x08000000" size="0x00200000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32H5xx_2M_0800.FLM" start="0x08000000" size="0x00200000" default="1" RAMstart="0x20000000" RAMsize="0x8000" />
          <algorithm name="CMSIS/Flash/STM32H5xx_2M_0C00.FLM" start="0x0C000000" size="0x00200000" default="1" RAMstart="0x20000000" RAMsize="0x8000" />
          <feature type="QFN" n="68"/>
        </device>

        <!-- *************************  Device 'STM32H573VI'  ***************************** -->
        <device Dname="STM32H573VITx">
          <memory name="Flash"   access="rx"                  start="0x08000000" size="0x00200000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32H5xx_2M_0800.FLM" start="0x08000000" size="0x00200000" default="1" RAMstart="0x20000000" RAMsize="0x8000" />
          <algorithm name="CMSIS/Flash/STM32H5xx_2M_0C00.FLM" start="0x0C000000" size="0x00200000" default="1" RAMstart="0x20000000" RAMsize="0x8000" />
          <feature type="QFP" n="100"/>
        </device>
        <device Dname="STM32H573VITxQ">
          <memory name="Flash"   access="rx"                  start="0x08000000" size="0x00200000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32H5xx_2M_0800.FLM" start="0x08000000" size="0x00200000" default="1" RAMstart="0x20000000" RAMsize="0x8000" />
          <algorithm name="CMSIS/Flash/STM32H5xx_2M_0C00.FLM" start="0x0C000000" size="0x00200000" default="1" RAMstart="0x20000000" RAMsize="0x8000" />
          <feature type="QFP" n="100"/>
        </device>
        <!-- *************************  Device 'STM32H573ZI'   ***************************** -->
        <device Dname="STM32H573ZITx">
          <memory name="Flash"   access="rx"                  start="0x08000000" size="0x00200000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32H5xx_2M_0800.FLM" start="0x08000000" size="0x00200000" default="1" RAMstart="0x20000000" RAMsize="0x8000" />
          <algorithm name="CMSIS/Flash/STM32H5xx_2M_0C00.FLM" start="0x0C000000" size="0x00200000" default="1" RAMstart="0x20000000" RAMsize="0x8000" />
          <feature type="QFP" n="144"/>
        </device>
        <device Dname="STM32H573ZITxQ">
          <memory name="Flash"   access="rx"                  start="0x08000000" size="0x00200000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32H5xx_2M_0800.FLM" start="0x08000000" size="0x00200000" default="1" RAMstart="0x20000000" RAMsize="0x8000" />
          <algorithm name="CMSIS/Flash/STM32H5xx_2M_0C00.FLM" start="0x0C000000" size="0x00200000" default="1" RAMstart="0x20000000" RAMsize="0x8000" />
          <feature type="QFP" n="144"/>
        </device>
