vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Keil.STM32H5xx_DFP.pdsc
        <!-- *************************  Device 'STM32H573II'   ***************************** -->
        <device Dname="STM32H573IITx">
          <memory name="Flash"   access="rx"                  start="0x08000000" size="0x00200000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32H5xx_2M_0800.FLM" start="0x08000000" size="0x00200000" default="1" RAMstart="0x20000000" RAMsize="0x8000" />
          <algorithm name="CMSIS/Flash/STM32H5xx_2M_0C00.FLM" start="0x0C000000" size="0x00200000" default="1" RAMstart="0x20000000" RAMsize="0x8000" />
          <feature type="QFP" n="176"/>
        </device>
        <device Dname="STM32H573IITxQ">
          <memory name="Flash"   access="rx"                  start="0x08000000" size="0x00200000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32H5xx_2M_0800.FLM" start="0x08000000" size="0x00200000" default="1" RAMstart="0x20000000" RAMsize="0x8000" />
          <algorithm name="CMSIS/Flash/STM32H5xx_2M_0C00.FLM" start="0x0C000000" size="0x00200000" default="1" RAMstart="0x20000000" RAMsize="0x8000" />
          <feature type="QFP" n="176"/>
        </device>
        <device Dname="STM32H573IIKx">
          <memory name="Flash"   access="rx"                  start="0x08000000" size="0x00200000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32H5xx_2M_0800.FLM" start="0x08000000" size="0x00200000" default="1" RAMstart="0x20000000" RAMsize="0x8000" />
          <algorithm name="CMSIS/Flash/STM32H5xx_2M_0C00.FLM" start="0x0C000000" size="0x00200000" default="1" RAMstart="0x20000000" RAMsize="0x8000" />
          <feature type="BGA" n="176"/>
        </device>
        <device Dname="STM32H573IIKxQ">
          <memory name="Flash"   access="rx"                  start="0x08000000" size="0x00200000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32H5xx_2M_0800.FLM" start="0x08000000" size="0x00200000" default="1" RAMstart="0x20000000" RAMsize="0x8000" />
          <algorithm name="CMSIS/Flash/STM32H5xx_2M_0C00.FLM" start="0x0C000000" size="0x00200000" default="1" RAMstart="0x20000000" RAMsize="0x8000" />
          <feature type="BGA" n="176"/>
        </device>
        <!-- *************************  Device 'STM32H573AI'   ***************************** -->
        <device Dname="STM32H573AIIx">
          <memory name="Flash"   access="rx"                  start="0x08000000" size="0x00200000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32H5xx_2M_0800.FLM" start="0x08000000" size="0x00200000" default="1" RAMstart="0x20000000" RAMsize="0x8000" />
          <algorithm name="CMSIS/Flash/STM32H5xx_2M_0C00.FLM" start="0x0C000000" size="0x00200000" default="1" RAMstart="0x20000000" RAMsize="0x8000" />
          <feature type="BGA" n="169"/>
        </device>
        <device Dname="STM32H573AIIxQ">
          <memory name="Flash"   access="rx"                  start="0x08000000" size="0x00200000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32H5xx_2M_0800.FLM" start="0x08000000" size="0x00200000" default="1" RAMstart="0x20000000" RAMsize="0x8000" />
          <algorithm name="CMSIS/Flash/STM32H5xx_2M_0C00.FLM" start="0x0C000000" size="0x00200000" default="1" RAMstart="0x20000000" RAMsize="0x8000" />
          <feature type="BGA" n="169"/>
        </device>
        <!-- *************************  Device 'STM32H573MI'   ***************************** -->
        <device Dname="STM32H573MIYxQ">
          <memory name="Flash"   access="rx"                  start="0x08000000" size="0x00200000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32H5xx_2M_0800.FLM" start="0x08000000" size="0x00200000" default="1" RAMstart="0x20000000" RAMsize="0x8000" />
          <algorithm name="CMSIS/Flash/STM32H5xx_2M_0C00.FLM" start="0x0C000000" size="0x00200000" default="1" RAMstart="0x20000000" RAMsize="0x8000" />
          <feature type="CSP" n="80"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'STM32H503'  *************************** -->
      <subFamily DsubFamily="STM32H503">
        <processor Dtz="NO_TZ"/>
        <debug __ap="1" svd="CMSIS/SVD/STM32H503.svd"/>
        <compile define="STM32H503xx"/>

        <book name="https://www.st.com/resource/en/reference_manual/rm0492-stm32h503-line-armbased-32bit-mcus-stmicroelectronics.pdf" title="STM32H503xx Reference Manual"/>
        <book name="https://www.st.com/resource/en/datasheet/stm32h503eb.pdf" title="STM32H503xx Data Sheet"/>

        <debugvars configfile="CMSIS/Debug/STM32H503xx.dbgconf" version="1.0.1">
          __var DbgMCU_CR       = 0x00000006;   // DBGMCU_CR: DBG_STOP, DBG_STANDBY
          __var DbgMCU_APB1L_Fz = 0x00E01833;   // DGBMCU_APB1LFZR: All Peripherals Operate as in Normal Mode
          __var DbgMCU_APB1H_Fz = 0x00000020;   // DGBMCU_APB1HFZR: All Peripherals Operate as in Normal Mode
          __var DbgMCU_APB2_Fz  = 0x00000800;   // DGBMCU_APB2FZR : All Peripherals Operate as in Normal Mode
          __var DbgMCU_APB3_Fz  = 0x00021000;   // DBGMCU_APB3FZR : All Peripherals Operate as in Normal Mode
          __var DbgMCU_AHB1_Fz  = 0x00FF00FF;   // DBGMCU_AHB1FZR : All Peripherals Operate as in Normal Mode
          __var TraceClk_Pin    = 0x00010005;   // PB5
          __var TraceD0_Pin     = 0x00010006;   // PB6
          __var TraceD1_Pin     = 0x00010007;   // PB7
          __var TraceD2_Pin     = 0x00010008;   // PB8
          __var TraceD3_Pin     = 0x0002000C;   // PC12
        </debugvars>

        <algorithm name="CMSIS/Flash/STM32H503_128k_0800.FLM" start="0x08000000" size="0x00020000" default="1" RAMstart="0x20000000" RAMsize="0x8000" />

        <memory name="Flash"     access="rx"                  start="0x08000000" size="0x00020000" default="1" startup="1" />
        <memory name="SRAM1"     access="rwx"                 start="0x20000000" size="0x00004000" default="1" init="0" />
        <memory name="SRAM2"     access="rwx"                 start="0x20004000" size="0x00004000" default="0" init="0" />

        <!-- ################################### 128kB ################################ -->
        <!-- *************************  Device 'STM32H503EB'   ************************ -->
        <device Dname="STM32H503EBYx">
          <feature type="CSP" n="25"/>
        </device>

        <!-- *************************  Device 'STM32H503KB'   ************************ -->
        <device Dname="STM32H503KBUx">
          <feature type="QFP" n="32"/>
        </device>

        <!-- *************************  Device 'STM32H503CB'   ************************ -->
        <device Dname="STM32H503CBUx">
          <feature type="QFP" n="48"/>
        </device>
        <device Dname="STM32H503CBTx">
          <feature type="QFP" n="48"/>
        </device>

        <!-- *************************  Device 'STM32H503RB'   ************************ -->
        <device Dname="STM32H503RBTx">
          <feature type="QFP" n="64"/>
        </device>
      </subFamily>

