vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Keil.STM32H5xx_DFP.pdsc
        <device Dname="STM32H523ZEJx">
          <memory name="Flash"   access="rx"                    start="0x08000000" size="0x0080000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32H5xx_512K_0800.FLM" start="0x08000000" size="0x0080000" default="1" RAMstart="0x20000000" RAMsize="0x8000" />
          <algorithm name="CMSIS/Flash/STM32H5xx_512K_0C00.FLM" start="0x0C000000" size="0x0080000" default="1" RAMstart="0x20000000" RAMsize="0x8000" />
          <feature type="BGA" n="144"/>
        </device>
        <!-- ################################### 256KB ################################## -->
        <!-- *************************  Device 'STM32H523CC'   ***************************** -->
        <device Dname="STM32H523CCUx">
          <memory name="Flash"   access="rx"                    start="0x08000000" size="0x0040000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32H5xx_256K_0800.FLM" start="0x08000000" size="0x0040000" default="1" RAMstart="0x20000000" RAMsize="0x8000" />
          <algorithm name="CMSIS/Flash/STM32H5xx_256K_0C00.FLM" start="0x0C000000" size="0x0040000" default="1" RAMstart="0x20000000" RAMsize="0x8000" />
          <feature type="QFN" n="48"/>
        </device>
        <device Dname="STM32H523CCTx">
          <memory name="Flash"   access="rx"                    start="0x08000000" size="0x0040000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32H5xx_256K_0800.FLM" start="0x08000000" size="0x0040000" default="1" RAMstart="0x20000000" RAMsize="0x8000" />
          <algorithm name="CMSIS/Flash/STM32H5xx_256K_0C00.FLM" start="0x0C000000" size="0x0040000" default="1" RAMstart="0x20000000" RAMsize="0x8000" />
          <feature type="QFP" n="48"/>
        </device>
        <!-- *************************  Device 'STM32H523RC'   ***************************** -->
        <device Dname="STM32H523RCTx">
          <memory name="Flash"   access="rx"                    start="0x08000000" size="0x0040000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32H5xx_256K_0800.FLM" start="0x08000000" size="0x0040000" default="1" RAMstart="0x20000000" RAMsize="0x8000" />
          <algorithm name="CMSIS/Flash/STM32H5xx_256K_0C00.FLM" start="0x0C000000" size="0x0040000" default="1" RAMstart="0x20000000" RAMsize="0x8000" />
          <feature type="QFP" n="64"/>
        </device>
        <!-- *************************  Device 'STM32H523VC'   ***************************** -->
        <device Dname="STM32H523VCTx">
          <memory name="Flash"   access="rx"                    start="0x08000000" size="0x0040000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32H5xx_256K_0800.FLM" start="0x08000000" size="0x0040000" default="1" RAMstart="0x20000000" RAMsize="0x8000" />
          <algorithm name="CMSIS/Flash/STM32H5xx_256K_0C00.FLM" start="0x0C000000" size="0x0040000" default="1" RAMstart="0x20000000" RAMsize="0x8000" />
          <feature type="QFP" n="100"/>
        </device>
        <device Dname="STM32H523VCIx">
          <memory name="Flash"   access="rx"                    start="0x08000000" size="0x0040000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32H5xx_256K_0800.FLM" start="0x08000000" size="0x0040000" default="1" RAMstart="0x20000000" RAMsize="0x8000" />
          <algorithm name="CMSIS/Flash/STM32H5xx_256K_0C00.FLM" start="0x0C000000" size="0x0040000" default="1" RAMstart="0x20000000" RAMsize="0x8000" />
          <feature type="BGA" n="100"/>
        </device>
        <!-- *************************  Device 'STM32H523ZC'   ***************************** -->
        <device Dname="STM32H523ZCTx">
          <memory name="Flash"   access="rx"                    start="0x08000000" size="0x0040000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32H5xx_256K_0800.FLM" start="0x08000000" size="0x0040000" default="1" RAMstart="0x20000000" RAMsize="0x8000" />
          <algorithm name="CMSIS/Flash/STM32H5xx_256K_0C00.FLM" start="0x0C000000" size="0x0040000" default="1" RAMstart="0x20000000" RAMsize="0x8000" />
          <feature type="QFP" n="144"/>
        </device>
        <device Dname="STM32H523ZCJx">
          <memory name="Flash"   access="rx"                    start="0x08000000" size="0x0040000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32H5xx_256K_0800.FLM" start="0x08000000" size="0x0040000" default="1" RAMstart="0x20000000" RAMsize="0x8000" />
          <algorithm name="CMSIS/Flash/STM32H5xx_256K_0C00.FLM" start="0x0C000000" size="0x0040000" default="1" RAMstart="0x20000000" RAMsize="0x8000" />
          <feature type="BGA" n="144"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'STM32H533'  *************************** -->
      <subFamily DsubFamily="STM32H533">
        <processor Dtz="TZ"/>
        <debug __ap="1" svd="CMSIS/SVD/STM32H533.svd"/>
        <compile define="STM32H533xx"/>

        <book name="https://www.st.com/resource/en/reference_manual/rm0481-stm32h52333xx-stm32h56263xx-and-stm32h573xx-armbased-32bit-mcus-stmicroelectronics.pdf" title="STM32H523/33xx, STM32H562/63xx and STM32H573xx Reference Manual"/>
        <book name="https://www.st.com/resource/en/datasheet/stm32h533ce.pdf" title="STM32H533xx Data Sheet"/>

        <debugvars configfile="CMSIS/Debug/STM32H562xx_H563xx_H573xx.dbgconf" version="1.0.1">
          __var DbgMCU_CR       = 0x00000006;   // DBGMCU_CR: DBG_STOP, DBG_STANDBY
          __var DbgMCU_APB1L_Fz = 0x00E019FF;   // DGBMCU_APB1LFZR: All Peripherals Operate as in Normal Mode
          __var DbgMCU_APB1H_Fz = 0x00000020;   // DGBMCU_APB1HFZR: All Peripherals Operate as in Normal Mode
          __var DbgMCU_APB2_Fz  = 0x00072800;   // DGBMCU_APB2FZR : All Peripherals Operate as in Normal Mode
          __var DbgMCU_APB3_Fz  = 0x003E0C00;   // DBGMCU_APB3FZR : All Peripherals Operate as in Normal Mode
          __var DbgMCU_AHB1_Fz  = 0x00FF00FF;   // DBGMCU_AHB1FZR : All Peripherals Operate as in Normal Mode
          __var TraceClk_Pin    = 0x00040002;   // PE2
          __var TraceD0_Pin     = 0x00040003;   // PE3
          __var TraceD1_Pin     = 0x00040004;   // PE4
          __var TraceD2_Pin     = 0x00040005;   // PE5
          __var TraceD3_Pin     = 0x00040006;   // PE6
        </debugvars>

        <memory name="SRAM1_2"   access="rwx"                   start="0x20000000" size="0x00034000" default="1" init="0" />
        <memory name="SRAM3"     access="rwx"                   start="0x20034000" size="0x00010000" default="0" init="0" />

