vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Keil.STM32H5xx_DFP.pdsc
        <!-- ################################### 512KB ################################## -->
        <!-- *************************  Device 'STM32H533HE'   ***************************** -->
        <device Dname="STM32H533HEYxT">
          <memory name="Flash"   access="rx"                    start="0x08000000" size="0x0080000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32H5xx_512K_0800.FLM" start="0x08000000" size="0x0080000" default="1" RAMstart="0x20000000" RAMsize="0x8000" />
          <algorithm name="CMSIS/Flash/STM32H5xx_512K_0C00.FLM" start="0x0C000000" size="0x0080000" default="1" RAMstart="0x20000000" RAMsize="0x8000" />
          <feature type="CSP" n="39"/>
        </device>
        <!-- *************************  Device 'STM32H533CE'   ***************************** -->
        <device Dname="STM32H533CEUx">
          <memory name="Flash"   access="rx"                    start="0x08000000" size="0x0080000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32H5xx_512K_0800.FLM" start="0x08000000" size="0x0080000" default="1" RAMstart="0x20000000" RAMsize="0x8000" />
          <algorithm name="CMSIS/Flash/STM32H5xx_512K_0C00.FLM" start="0x0C000000" size="0x0080000" default="1" RAMstart="0x20000000" RAMsize="0x8000" />
          <feature type="QFN" n="48"/>
        </device>
        <device Dname="STM32H533CETx">
          <memory name="Flash"   access="rx"                    start="0x08000000" size="0x0080000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32H5xx_512K_0800.FLM" start="0x08000000" size="0x0080000" default="1" RAMstart="0x20000000" RAMsize="0x8000" />
          <algorithm name="CMSIS/Flash/STM32H5xx_512K_0C00.FLM" start="0x0C000000" size="0x0080000" default="1" RAMstart="0x20000000" RAMsize="0x8000" />
          <feature type="QFP" n="48"/>
        </device>
        <!-- *************************  Device 'STM32H533RE'   ***************************** -->
        <device Dname="STM32H533RETx">
          <memory name="Flash"   access="rx"                    start="0x08000000" size="0x0080000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32H5xx_512K_0800.FLM" start="0x08000000" size="0x0080000" default="1" RAMstart="0x20000000" RAMsize="0x8000" />
          <algorithm name="CMSIS/Flash/STM32H5xx_512K_0C00.FLM" start="0x0C000000" size="0x0080000" default="1" RAMstart="0x20000000" RAMsize="0x8000" />
          <feature type="QFP" n="64"/>
        </device>
        <!-- *************************  Device 'STM32H533VE'   ***************************** -->
        <device Dname="STM32H533VETx">
          <memory name="Flash"   access="rx"                    start="0x08000000" size="0x0080000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32H5xx_512K_0800.FLM" start="0x08000000" size="0x0080000" default="1" RAMstart="0x20000000" RAMsize="0x8000" />
          <algorithm name="CMSIS/Flash/STM32H5xx_512K_0C00.FLM" start="0x0C000000" size="0x0080000" default="1" RAMstart="0x20000000" RAMsize="0x8000" />
          <feature type="QFP" n="100"/>
        </device>
        <device Dname="STM32H533VEIx">
          <memory name="Flash"   access="rx"                    start="0x08000000" size="0x0080000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32H5xx_512K_0800.FLM" start="0x08000000" size="0x0080000" default="1" RAMstart="0x20000000" RAMsize="0x8000" />
          <algorithm name="CMSIS/Flash/STM32H5xx_512K_0C00.FLM" start="0x0C000000" size="0x0080000" default="1" RAMstart="0x20000000" RAMsize="0x8000" />
          <feature type="BGA" n="100"/>
        </device>
        <!-- *************************  Device 'STM32H533ZE'   ***************************** -->
        <device Dname="STM32H533ZETx">
          <memory name="Flash"   access="rx"                    start="0x08000000" size="0x0080000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32H5xx_512K_0800.FLM" start="0x08000000" size="0x0080000" default="1" RAMstart="0x20000000" RAMsize="0x8000" />
          <algorithm name="CMSIS/Flash/STM32H5xx_512K_0C00.FLM" start="0x0C000000" size="0x0080000" default="1" RAMstart="0x20000000" RAMsize="0x8000" />
          <feature type="QFP" n="144"/>
        </device>
        <device Dname="STM32H533ZEJx">
          <memory name="Flash"   access="rx"                    start="0x08000000" size="0x0080000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32H5xx_512K_0800.FLM" start="0x08000000" size="0x0080000" default="1" RAMstart="0x20000000" RAMsize="0x8000" />
          <algorithm name="CMSIS/Flash/STM32H5xx_512K_0C00.FLM" start="0x0C000000" size="0x0080000" default="1" RAMstart="0x20000000" RAMsize="0x8000" />
          <feature type="BGA" n="144"/>
        </device>
      </subFamily>

    </family>

  </devices>

  <conditions>
    <!-- Device Conditions -->
    <condition id="STM32H5">
      <description>STMicroelectronics STM32H5 Devices</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32H5*"/>
    </condition>

    <!-- Device + CMSIS Conditions -->
    <condition id="STM32H5 CMSIS">
      <description>STMicroelectronics STM32H5 Device and CMSIS-CORE</description>
      <require condition="STM32H5"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

  </conditions>

  <components>
    <!-- CubeMX Generator -->
    <component generator="CubeMX" Cclass="Device" Cgroup="CubeMX" Cversion="1.0.0" condition="STM32H5 CMSIS">
      <description>Configuration via STM32CubeMX</description>
      <RTE_Components_h>
        #define RTE_DEVICE_CUBE_MX
        #define CMSIS_device_header "stm32h5xx.h"
      </RTE_Components_h>
      <files>
        <file category="doc" name="https://open-cmsis-pack.github.io/cmsis-toolbox/CubeMX"/>
      </files>
    </component>
  </components>

  <csolution>
    <!-- CubeMX Basic CMSIS Solution template -->
    <template name="CubeMX Basic solution" path="Templates/CubeMX" file="CubeMX.csolution.yml" condition="STM32H5">
      <description>Create a CubeMX basic solution with project</description>
    </template>

    <!-- CubeMX TrustZone CMSIS Solution template -->
    <template name="CubeMX TrustZone solution" path="Templates/CubeMX_TZ" file="CubeMX_TZ.csolution.yml" condition="STM32H5">
      <description>Create a CubeMX TrustZone solution with secure and non-secure projects</description>
    </template>

  </csolution>
</package>
